use tukku_rust_macro::kannada;

fn main() {
    kannada! {
        ಸಾರ್ವಜನಿಕ ಕಾರ್ಯ ಮುಖ್ಯ() {
            ಮಾಡು graph = [
                [0, 4, 0, 0, 0, 0, 0, 8, 0],
                [4, 0, 8, 0, 0, 0, 0, 11, 0],
                [0, 8, 0, 7, 0, 4, 0, 0, 2],
                [0, 0, 7, 0, 9, 14, 0, 0, 0],
                [0, 0, 0, 9, 0, 10, 0, 0, 0],
                [0, 0, 4, 14, 10, 0, 2, 0, 0],
                [0, 0, 0, 0, 0, 2, 0, 1, 6],
                [8, 11, 0, 0, 0, 0, 1, 0, 7],
                [0, 0, 2, 0, 0, 0, 6, 7, 0],
            ];

            ಮಾಡು n = 9;
            ಮಾಡು dist = [i32::MAX; 9];
            ಮಾಡು visited = [ಸುಳ್ಳು; 9];
            dist[0] = 0;

            ಪ್ರತಿಯಾಗಿ _ ಒಳಗೆ 0..n {
                ಮಾಡು u = 0;
                ಮಾಡು min = i32::MAX;
                ಪ್ರತಿಯಾಗಿ i ಒಳಗೆ 0..n {
                    ಯದಿ !visited[i] && dist[i] <= min {
                        min = dist[i];
                        u = i;
                    }
                }

                visited[u] = ನಿಜ;

                ಪ್ರತಿಯಾಗಿ v ಒಳಗೆ 0..n {
                    ಯದಿ !visited[v] && graph[u][v] != 0 && dist[u] + graph[u][v] < dist[v] {
                        dist[v] = dist[u] + graph[u][v];
                    }
                }
            }

            ಪ್ರತಿಯಾಗಿ i ಒಳಗೆ 0..n {
                ಮುದ್ರಿಸು!("{}: {}", i, dist[i]);
            }
        }
    }
}
